In [1]:
var = 10
print(var)

10

In [1]:
type(1)

int

In [2]:
3**2

9

In [3]:
7//3

2

In [4]:
7%3

1

In [6]:
multiline = """Life is
too short"""
print(multiline)

Life is
too short

In [9]:
c = 'Quant'
c*3

'QuantQuantQuant'

In [11]:
name = 'OOOO'
birth = '1987'
f'나의 이름은 {name}이며, {birth}년에 태어났다.'

'나의 이름은 OOOO이며, 1987년에 태어났다.'

In [12]:
var = 'Quant'
var[0:3]

'Qua'

In [13]:
var[3:]

'nt'

In [15]:
var = [1, 2, ['a', 'b', 'c']]
var[2][0]

'a'

In [17]:
var = [1, 2, 3]
var.append([4, 5])
var

[1, 2, 3, [4, 5]]

In [18]:
var = [1, 2, 3]
var.extend([4, 5])
var

[1, 2, 3, 4, 5]

In [19]:
del var[0]
var

[2, 3, 4, 5]

In [20]:
var[0:1] = []
var

[3, 4, 5]

In [21]:
var = [1, 2, 3, 1, 2, 3]
var.remove(1)
var

[2, 3, 1, 2, 3]

In [22]:
var.pop()

3

In [23]:
var

[2, 3, 1, 2]

In [24]:
var.sort()
var

[1, 2, 2, 3]

In [25]:
var = (1, 2, 3)
del var[0]

TypeError: 'tuple' object doesn't support item deletion

In [26]:
var = {'k1': 1, 'k2': 2}
var

{'k1': 1, 'k2': 2}

In [27]:
type(var)

dict

In [29]:
var['k3'] = 3
var

{'k1': 1, 'k2': 2, 'k3': 3}

In [30]:
del var['k3']

In [31]:
var.keys()

dict_keys(['k1', 'k2'])

In [32]:
list(var.keys())

['k1', 'k2']

In [33]:
var.values()

dict_values([1, 2])

In [34]:
var = set([1, 2, 3])
type(var)

set

In [35]:
var = set('banana')
var

{'a', 'b', 'n'}

In [37]:
s1 = set([1, 2, 3, 4])
s2 = set([3, 4, 5, 6])

In [38]:
s1.union(s2)

{1, 2, 3, 4, 5, 6}

In [39]:
s1.intersection(s2)

{3, 4}

In [40]:
s1.difference(s2)

{1, 2}

In [41]:
var = True
type(var)

bool

In [42]:
1 == 1

True

In [43]:
bool(0)

False

In [44]:
bool(1)

True

In [45]:
bool(2)

True

In [46]:
import datetime

In [48]:
var = datetime.datetime.now()
var

datetime.datetime(2023, 8, 10, 22, 46, 47, 836401)

In [49]:
type(var)

datetime.datetime

In [50]:
var.year

2023

In [51]:
var.month

8

In [52]:
var.day

10

In [53]:
var.hour

22

In [54]:
var.minute

46

In [55]:
var.second

47

In [56]:
var.weekday()

3

In [57]:
var.date(), var.time()

(datetime.date(2023, 8, 10), datetime.time(22, 46, 47, 836401))

In [58]:
var.strftime('%Y-%m-%d')

'2023-08-10'

In [59]:
datetime.datetime.strptime("2022-12-13", "%Y-%m-%d")

datetime.datetime(2022, 12, 13, 0, 0)

In [60]:
dt1 = datetime.datetime(2022, 12, 31)
dt2 = datetime.datetime(2021, 12, 31)
td = dt1 - dt2
td

datetime.timedelta(days=365)

In [61]:
dt1 + datetime.timedelta(days = 3)

datetime.datetime(2023, 1, 3, 0, 0)

In [62]:
from dateutil.relativedelta import relativedelta

In [63]:
dt1 + relativedelta(months=1)

datetime.datetime(2023, 1, 31, 0, 0)

In [64]:
import time

In [65]:
for i in range(3):
    print(i)
    print(datetime.datetime.now())
    print('------')
    time.sleep(2)

0
2023-08-10 22:55:55.289047
------
1
2023-08-10 22:55:57.295224
------
2
2023-08-10 22:55:59.298112
------

In [66]:
x = 3
if x >= 10:
    print('1')
elif x >= 0:
    print('2')
else:
    print('3')

2

In [67]:
'0 이상' if x >= 0 else '음수'

'0 이상'

In [68]:
a = [1, 2, 3]
result = [i**2 for i in a]
result

[1, 4, 9]

In [69]:
from tqdm import tqdm

In [70]:
for i in tqdm(range(10)):
    time.sleep(0.1)

100%|██████████| 10/10 [00:01<00:00,  9.51it/s]

In [71]:
divide_lam = lambda x, n: x / n
divide_lam(6, 3)

2.0

In [73]:
import pandas as pd

In [75]:
import selenium

In [76]:
dir(selenium)

['__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__']

In [77]:
import selenium.webdriver

In [78]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [79]:
df = pd.DataFrame({'x': [1, 2, 3]})
df

   x
0  1
1  2
2  3

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

In [82]:
dict_data = {'a': 1, 'b': 2, 'c': 3}
series = pd.Series(dict_data)
series

a    1
b    2
c    3
dtype: int64

In [83]:
series.index

Index(['a', 'b', 'c'], dtype='object')

In [84]:
series.values

array([1, 2, 3])

In [86]:
list_data = ['a', 'b', 'c']
series = pd.Series(list_data)
series

0    a
1    b
2    c
dtype: object

In [87]:
series = pd.Series(list_data, index=['idx1', 'idx2', 'idx3'])
series

idx1    a
idx2    b
idx3    c
dtype: object

In [88]:
series[['idx1', 'idx2']]

idx1    a
idx2    b
dtype: object

In [89]:
series[0]

'a'

In [90]:
series_1 = pd.Series([1, 2, 3])
series_2 = pd.Series([4, 5, 6])

series_1 + series_2

0    5
1    7
2    9
dtype: int64

In [91]:
dict_data = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(dict_data)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [92]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], index=['idx1', 'idx2', 'idx3'], columns=['col1', 'col2', 'col3'])
df

      col1  col2  col3
idx1     1     2     3
idx2     4     5     6
idx3     7     8     9

In [93]:
df.index

Index(['idx1', 'idx2', 'idx3'], dtype='object')

In [94]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [96]:
df.rename(index={'idx1': '일번'}, inplace=True)
df

      col1  col2  col3
일번       1     2     3
idx2     4     5     6
idx3     7     8     9

In [100]:
df

      col1  col2  col3
일번       1     2     3
idx2     4     5     6

In [101]:
df.drop('idx2', axis=0, inplace=True)
df

    col1  col2  col3
일번     1     2     3

In [102]:
df['col1']

일번    1
Name: col1, dtype: int64

In [103]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], index=['idx1', 'idx2', 'idx3'], columns=['col1', 'col2', 'col3'])

In [104]:
df['col1']

idx1    1
idx2    4
idx3    7
Name: col1, dtype: int64

In [105]:
df.col1

idx1    1
idx2    4
idx3    7
Name: col1, dtype: int64

In [106]:
type(df['col1'])

pandas.core.series.Series

In [107]:
type(df[['col1']])

pandas.core.frame.DataFrame

In [108]:
df[['col1', 'col2']]

      col1  col2
idx1     1     2
idx2     4     5
idx3     7     8

In [110]:
df.loc['idx1']

col1    1
col2    2
col3    3
Name: idx1, dtype: int64

In [111]:
df.iloc[0]

col1    1
col2    2
col3    3
Name: idx1, dtype: int64

In [112]:
df.loc[['idx1']]

      col1  col2  col3
idx1     1     2     3

In [113]:
df.loc['idx1', 'col1']

1

In [114]:
df.loc[['idx1', 'idx2'], ['col1', 'col3']]

      col1  col3
idx1     1     3
idx2     4     6

In [115]:
df.loc['idx1':'idx2', 'col1':'col3']

      col1  col2  col3
idx1     1     2     3
idx2     4     5     6

In [116]:
data_csv = pd.read_csv('https://raw.githubusercontent.com/hyunyulhenry/quant_py/main/kospi.csv')
data_csv

           Date    Close   Ret
0    2020-01-02  2175.17 -1.02
1    2020-01-03  2176.46  0.06
2    2020-01-06  2155.07 -0.98
3    2020-01-07  2175.54  0.95
4    2020-01-08  2151.31 -1.11
..          ...      ...   ...
243  2020-12-23  2759.82  0.96
244  2020-12-24  2806.86  1.70
245  2020-12-28  2808.60  0.06
246  2020-12-29  2820.51  0.42
247  2020-12-30  2873.47  1.88

[248 rows x 3 columns]

In [117]:
data_csv.to_csv('data.csv')

In [119]:
data_excel = pd.read_excel('https://github.com/hyunyulhenry/quant_py/raw/main/kospi.xlsx', sheet_name='kospi')
data_excel

          Date    Close   Ret
0   2020-01-02  2175.17 -1.02
1   2020-01-03  2176.46  0.06
2   2020-01-06  2155.07 -0.98
3   2020-01-07  2175.54  0.95
4   2020-01-08  2151.31 -1.11
..         ...      ...   ...
243 2020-12-23  2759.82  0.96
244 2020-12-24  2806.86  1.70
245 2020-12-28  2808.60  0.06
246 2020-12-29  2820.51  0.42
247 2020-12-30  2873.47  1.88

[248 rows x 3 columns]

In [120]:
df = sns.load_dataset('titanic')

In [121]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [122]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [124]:
df.shape

(891, 15)

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [126]:
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [127]:
df[['sex', 'survived']].value_counts()

sex     survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [130]:
df[['sex', 'survived']].value_counts(normalize=True).sort_index()

sex     survived
female  0           0.090909
        1           0.261504
male    0           0.525253
        1           0.122334
Name: proportion, dtype: float64

In [131]:
df['survived'].mean()

0.3838383838383838

In [132]:
df['survived'].value_counts(normalize=True)

survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [133]:
df['fare'].median()

14.4542

In [134]:
df['fare'].mean()

32.204207968574636

In [135]:
df.shape

(891, 15)

In [136]:
df.dropna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [137]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [138]:
df.dropna(subset=['age'], axis=0)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [139]:
df.dropna(axis=1)

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,man,True,no,True
887,1,1,female,0,0,30.0000,First,woman,False,yes,True
888,0,3,female,1,2,23.4500,Third,woman,False,no,False
889,1,1,male,0,0,30.0000,First,man,True,yes,True
890,0,3,male,0,0,7.7500,Third,man,True,no,True

In [140]:
df.dropna(axis=1, thresh=300)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [143]:
df_1 = df.copy()
mean_age = df_1['age'].mean()
print(mean_age)
df_1['age'].fillna(mean_age, inplace=True)
df_1

29.69911764705882

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [144]:
df_1['age'].mean()

29.69911764705882

In [146]:
df_1.dropna(subset=['age'], axis=0)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [147]:
left = pd.DataFrame({
    "key": ["K0", "K1", "K2", "K3"],
    "A": ["A0", "A1", "A2", "A3"],
    "B": ["B0", "B1", "B2", "B3"]
})

right = pd.DataFrame({
    "key": ["K0", "K1", "K3", "K4"],
    "C": ["C0", "C1", "C3", "C4"],
    "D": ["D0", "D1", "D3", "D4"]
})

result = pd.merge(left, right, on="key")
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C3  D3

In [148]:
result = pd.merge(left, right, on="key", how="left")
result

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C3   D3

In [149]:
result = pd.merge(left, right, on="key", how="right")
result

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C3  D3
3  K4  NaN  NaN  C4  D4

In [150]:
result = pd.merge(left, right, on="key", how="outer")
result

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4

In [152]:
result = pd.merge(left, right, left_on="key", right_on="key", how="outer")
result

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4

In [153]:
result = left.merge(right, left_on="key", right_on="key", how="outer")
result

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4

In [154]:
left = pd.DataFrame({
    "A": ["A0", "A1", "A2", "A3"],
    "B": ["B0", "B1", "B2", "B3"]
},
                    index=["K0", "K1", "K2", "K3"])

right = pd.DataFrame({
    "C": ["C0", "C1", "C3", "C4"],
    "D": ["D0", "D1", "D3", "D4"]
},
                index=["K0", "K1", "K3", "K4"])

left
right

     C   D
K0  C0  D0
K1  C1  D1
K3  C3  D3
K4  C4  D4

In [155]:
result = left.join(right)

In [156]:
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2  NaN  NaN
K3  A3  B3   C3   D3

In [157]:
import seaborn as sns

In [158]:
sf = sns.load_dataset('penguins')
sf.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [159]:
sf.shape

(344, 7)

In [160]:
df = sf.melt(id_vars=['species', 'island'])
df

     species     island        variable   value
0     Adelie  Torgersen  bill_length_mm    39.1
1     Adelie  Torgersen  bill_length_mm    39.5
2     Adelie  Torgersen  bill_length_mm    40.3
3     Adelie  Torgersen  bill_length_mm     NaN
4     Adelie  Torgersen  bill_length_mm    36.7
...      ...        ...             ...     ...
1715  Gentoo     Biscoe             sex     NaN
1716  Gentoo     Biscoe             sex  Female
1717  Gentoo     Biscoe             sex    Male
1718  Gentoo     Biscoe             sex  Female
1719  Gentoo     Biscoe             sex    Male

[1720 rows x 4 columns]

In [161]:
sf.pivot_table(
    index='species',
    columns='island',
    values='bill_length_mm',
    aggfunc='mean'
)

island        Biscoe      Dream  Torgersen
species
Adelie     38.975000  38.501786   38.95098
Chinstrap        NaN  48.833824        NaN
Gentoo     47.504878        NaN        NaN